# здесь подключаются модули
import pygame
import sys
 
# здесь определяются константы, классы и функции
FPS = 60
 
# здесь происходит инициация, создание объектов и др.
pygame.init()
screen_width=600
screen_height=400
screen = pygame.display.set_mode((screen_width, screen_height))
clock = pygame.time.Clock()
 
# если надо до цикла отобразить объекты на экране
pygame.display.update()

player_x=7
xvel=10

# главный цикл
while True:
    screen.fill((255-(255//6), 255, 255))
    # задержка
    clock.tick(FPS)
 
    # цикл обработки событий
    for i in pygame.event.get():
        if i.type == pygame.QUIT:
            pygame.quit()
            sys.exit()
            exit()
 
    # --------
    # изменение объектов и многое др.
    # прорисовка уровня
    level=["111111111111111111111111111111",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000010000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "100000000000000000000000000001",
           "111111111111111111111111111111"]
    block_width=20
    block_height=20
    for y in range(20):
        for x in range(30):
            if level[y][x]=="1":
                pygame.draw.rect(screen, (0, 70, 0), (x*block_width, y*block_height, block_width, block_height))
    # рисуем персонажа.
    pygame.draw.rect(screen, (20, 20, 20), (player_x*block_width, 5*block_height, 10, 20))
    # изменяем координаты персонажа
    player_x+=xvel
    xvel=xvel*0.1
    if xvel==0:
        player_x=int(player_x)
    # --------
 
    # обновление экрана
    pygame.display.update()
